In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect("student.db")

In [3]:
cur = connection.cursor()

In [4]:
print(cur)

<sqlite3.Cursor object at 0x000001D120184540>

In [5]:
print(connection)

<sqlite3.Connection object at 0x000001D11EF65D50>

In [8]:
query = """
create table std1(
roll_no int,
name varchar[40],
age int,
address varchar[40]
)
"""

In [9]:
cur.execute(query)

In [10]:
query = """
insert into std1(
roll_no, name, age, address
)
values(
1, "Rajendra", 25, "Bhaktapur"
),
(
2, "Naresh", 24, "Kathmandu"
)
"""

In [11]:
cur.execute(query)

In [13]:
cur.execute("select * from std1").fetchall()

[(1, 'Rajendra', 25, 'Bhaktapur'), (2, 'Naresh', 24, 'Kathmandu')]

In [14]:
query = """
select name from std1
where roll_no = 2
"""

In [15]:
cur.execute(query).fetchall()

[('Naresh',)]

In [16]:
cur.execute("select address from std1 where roll_no = 1").fetchall()

[('Bhaktapur',)]

In [17]:
cur.execute("select name from std1").fetchall()

[('Rajendra',), ('Naresh',)]

In [19]:
cur.execute("select age from std1").fetchall()

[(25,), (24,)]

In [20]:
query = """
update std1
set name = "Rajendra Niroula", age = 24
where roll_no = 1
"""

In [21]:
cur.execute(query)

In [22]:
cur.execute("select * from std1").fetchall()

[(1, 'Rajendra Niroula', 24, 'Bhaktapur'), (2, 'Naresh', 24, 'Kathmandu')]

In [23]:
query = """
update std1
set name = "Naresh Dhimal", address = "Bhaktapur", age = 25
where roll_no = 2

"""

In [24]:
cur.execute(query)

In [25]:
cur.execute("select * from std1").fetchall()

[(1, 'Rajendra Niroula', 24, 'Bhaktapur'),
 (2, 'Naresh Dhimal', 25, 'Bhaktapur')]

In [26]:
query = """
insert into std1(
roll_no, name, age, address
)
values(
3, "Raju", 26, "Kathmandu"
),
(4, "Bishal", 25, "Kirtipur")
"""

In [27]:
cur.execute(query)

In [29]:
cur.execute("select * from std1").fetchall()

[(1, 'Rajendra Niroula', 24, 'Bhaktapur'),
 (2, 'Naresh Dhimal', 25, 'Bhaktapur'),
 (3, 'Raju', 26, 'Kathmandu'),
 (4, 'Bishal', 25, 'Kirtipur')]

In [30]:
query = """
delete from std1
where name = "Rajendra Niroula"
"""

In [31]:
cur.execute(query)

In [33]:
cur.execute("select * from std1").fetchall()

[(2, 'Naresh Dhimal', 25, 'Bhaktapur'),
 (3, 'Raju', 26, 'Kathmandu'),
 (4, 'Bishal', 25, 'Kirtipur')]

In [41]:
query = """
delete from std1
where age = 25
"""

In [44]:
cur.execute(query)

In [45]:
cur.execute("select * from std1").fetchall()

[(2, 'Naresh Dhimal', 25, 'Bhaktapur'), (3, 'Raju', 26, 'Kathmandu')]